""" 
引数で受け取った半径の円の円周を計算して返す関数と、
引数で受け取った半径の円の面積を計算して返す関数をラムダ式を用いて定義しなさい。
2つの関数の引数は実数でも受け取れるものとします。
その関数を利用して、ユーザが画面に入力した実数が半径となる円の円周と面積を以下の実行例を参考に
画面に表示するプログラムを作成しなさい。なお、円周率は正しい値を用いることとし、
計算結果は小数第3位以下を切り捨てとします。
【実行例】
半径を入力してください: 4.7
半径4.7の円の円周は29.53
半径4.7の円の面積は69.39
"""
from math import pi, floor

#円周と半径を求める関数
cir = lambda radius: radius * 2 * pi 
size = lambda radius: radius ** 2 * pi

#半径の入力
radius = float(input('半径を入力してください: '))

#結果の表示
print(f'半径{radius}の円の円周は{(floor(cir(radius) * 100))/100}')
print(f'半径{radius}の円の面積は{(floor(size(radius) * 100))/100}')
